Tekla.Structures.AnalysisInternal.DotAnalysisMember.analysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisMember.material
The material of the analysis member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember.label
The label of the analysis member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember.start
The analysis beam end settings at the start of the member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember.end
The analysis beam end settings at the end of the member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember.curvature
The beam curvature of the member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember.composite
The composite settings of the member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember.analysisDesignCode
The analysis design code.